"302 ContributorsTranslationsPortuguêsEspañolРусскийTürkçe한국어FE!N Lyrics[Intro: Travis Scott & Sheck Wes]\nJust come outside for the night (Yeah)\nTake your time, get your light (Yeah)\nJohnny Dang, yeah, yeah\nI been out geekin' (Bitch)\n\n[Chorus: Playboi Carti, Sheck Wes & Travis Scott]\nFiend, fiend, fiend, fiend, fiend (Yeah)\nFiend, fiend, fiend, fiend, fiend (Yeah)\nFiend, fiend, fiend, fiend, fiend\nFiend, fiend (Yeah), fiend, fiend, fiend\n\n[Verse 1: Travis Scott & Sheck Wes]\nThe career's more at stake when you in your prime (At stake)\nFuck that paper, baby, my face on the dotted line (Dot, yeah)\nI been flyin' out of town for some peace of mind (Yeah, yeah, bitch)\nIt's like always they just want a piece of mine (Ah)\nI been focused on the future, never on right now (Ah)\nWhat I'm sippin' not kombucha, either pink or brown (It's lit)\nI'm the one that introduced you to the you right now (Mmm, let's go)\nOh my God, that bitch bitin' (That bitch bitin')\nWell, alright (Alright), tryna vibe (I'm tryna vibe this)\nIn the night, come alive\nAin't asleep, ain't a—, ain't a—, ain't-ain't\n\n[Chorus: Playboi Carti]\nFiend, fiend, fiend, fiend, fiend\nFiend, fiend, fiend, fiend, fiend\nFiend, fiend, fiend, fiend, fiend\nFiend, fiend, fiend, fiend\nFiend, fiend, fiend, fiend, fiend\nSee Travis Scott LiveGet tickets as low as $22You might also like[Bridge: Playboi Carti]\nSyrup, woah, what?\nWhat?\n(Homixide, Homixide, Homixide, Homixide)\nWhat? (Yeah)\nWoah, woah (Yeah, yeah)\n(Homixide, Homixide, Homixide, Homixide)\nHit, yeah, hold up (Yeah)\n\n[Verse 2: Playboi Carti]\nYeah, I just been poppin' my shit and gettin' it live, hold up (Shit)\nYeah, you try to come wrong 'bout this shit, we poppin' your tires, hold up (Shit)\nUh, hundred round (Woah), feelin' like I'm on ten\nPlayin' both sides with these hoes (Hold up), shorty, I'm fuckin' your friend (Hold up)\nI've been goin' crazy, shorty, I've been in the deep end\nShe not innocent, uh, she just tryna go\n\n[Chorus: Playboi Carti & Travis Scott]\nFiend (Talkin' 'bout), fiend, fiend (Yeah), fiend, fiend (Syrup, oh, oh, what? Syrup)\nFiend, fiend (Syrup), fiend, fiend, fiend (Oh, oh)\nFiend, fiend (Talkin' 'bout), fiend, fiend, fiend, fiend (Talkin' 'bout, let's go)\n[Verse 3: Playboi Carti & Travis Scott]\nI just been icin' my hoes, I just been drippin' my hoes (Drippin' my hoes)\nThis is a whole 'nother level, shorty (Oh), I got these hoes on they toes (Hoes on they toes)\nI put the bitch on the road, she tryna fuck on the O, hold up, hold up\nI got this ho with me, she tryna show me somethin', hold up, hold up (Oh)\nI got flows for days, these niggas ain't knowin' nothin', hold up, yeah (Oh)\nMe and my boy locked in, you know we on one, hold up, uh (Slatt, slatt)\nWe in the spot goin' crazy until the sun up\nYou worried about that ho, that ho done chose up (Slatt, bitch-ass)\nUh, pistols all in the kitchen, can't give the zip code up, hold up, yeah (Wow)\nFiend, fiend, fiend (Huh? Huh? Huh? Huh? Yeah)\nWhy the fuck these niggas actin' like they know us?\nDouble O, Cactus, yeah, we towed up (Skrrt, skrrt), uh, yeah\nSwitch out the bag, these niggas get rolled up, hold up (It's lit), slatt\nEverything hit, hold up, everything Homixide, Homixide (Homixide, Homixide, Homixide, Homixide, Homixide)\n[Outro: Playboi Carti]\nFiend, fiend, fiend, fiend, fiend, fiend (Homixide, Homixide, Homixide, Homixide, Homixide, Homixide, Homixide)28Embed"