"130 ContributorsTranslationsEspañolРусскийPortuguêsTürkçe한국어DeutschI KNOW ? Lyrics[Chorus]\nTell me, is you still up? (Up)\nIt's five A.M. and I'm drunk right now\nTell me, can we still fuck? (Fuck that shit)\nOne of one, I'm in the zone right now\nTell me, am I still? (Mmm)\nTellin' you just how I feel right now\nYou said it's just the drugs and I know\nI know, I know, I know, I know, I know, I know\nI lied too, way before (Let's go), before\nBefore I had you right inside my arms\nBut then again, I could be drunk (It's lit, yeah)\n\n[Verse 1]\nBaby, I don't wanna sound righteous (Yeah)\nI got twenty bitches suckin' like bisons\nI just eeny, meeny, miney, roll the dices, I pick her (Pop it, pop it)\nShe ain't even really my type, been out here\nShe been losin' herself to the night shift\nShe been losin' herself and I get it, oh, girl, yeah, I get it\nYeah, yeah, you've been fightin' for your shot\nAnd you've been searchin' for your spot\nGirl, I feel it, yeah, girl, I feel it, yeah\nOh, you think you got your groove\nBut you want someone like you (Let's go)\nSee Travis Scott LiveGet tickets as low as $50You might also like[Chorus]\nTell me, is you still up? (Up)\nIt's five A.M. and I'm drunk right now\nTell me, can we still fuck? (Fuck that shit)\nOne of one, I'm in the zone right now\nTell me, am I still? (Mmm)\nTellin' you just how I feel right now\nYou said it's just the drugs and I know\nI know, I know, I know, I know, I know, I know (Ooh, it's the kid, know it, damn it)\nI lied too, way before, before (How they feelin', how they feelin', ooh)\nBefore I had you right inside my arms (Feelin' like some money tonight)\nBut then again, I could be drunk (Yeah)\n\n[Verse 2]\nI know, mami, I know (Know), it's two A.M., don't stress (Stress)\nAt three, that bullshit kick in, in thirty, you'll feel your best\nI turned my whole spot to crucial, it's crucial, the way I left (It's lit)\nUpstairs is like a low, my new bitches be the best (Let's go)\nI'm lookin' at her, when her startin' to turn into you (Her)\nNow you startin' to fuck up my mind, is it you, is it her?\nWe brought Booby Trap to the 'burbs\nF29 is my address, in case you ain't heard\nIt's floodin' upstairs, it's a leak\nI don't make it squeak, make it squirt\nI make this shit beat, bon appétit when I feast\nSlippin' and slide through the streets, it takes a finesse\nEspecially in this Cabriolet Jeep, engine make it hard to creep\nJust leave the gate open, through the side door, I'ma creep (Ooh, ooh)\nAre you 'bout it? Too real, and are the kids downstairs asleep?\nAnd are you upstairs by yourself? A minute from there\nIs there some room for me? Baby, do tell, do tell\n[Chorus]\nTell me, is you still up? (Up)\nIt's five A.M. and I'm drunk right now\nTell me, can we still fuck? (Fuck that shit)\nOne of one, I'm in the zone right now\nTell me, am I still? (Mmm)\nTellin' you just how I feel right now\nYou said it's just the drugs and I know\nI know, I know, I know, I know, I know, I know\nI lied too, way before (Let's go), before\nBefore I had you right inside my arms\nBut then again, I could be drunk13Embed"