"222 ContributorsTranslationsEspañolРусскийTürkçePortuguêsEnglishMELTDOWN Lyrics[Part I]\n\n[Intro: Drake]\nYeah\nTensions is definitely rising\nT'd up right now\nT time, T time\nT time, T time, T time\n\n[Verse 1: Drake]\nTeatime like I got a cup of this shit\nTee time like golf at a quarter to six\nI'd love to fuck on a regular bitch\nFamous hoes lame but they stay on my dick\nHeard your new joint, it's embarrassing, shit\nYou talk to the cops on some therapist shit\nYou act like you love this American shit\nBut, really, the truth is you scared of the 6\nYeah, you scared of the 6\nYeah, you scared of the 6\nYour bodyguard put in some work on a fluke\nNow you wanna go and inherit that shit\nDon't talk to the boy 'bout comparisons, shit\nOr come to the boy on some arrogant shit\nThe weapons we got are some terrorist shit\nLike TV producers we, grr, we airing this shit\nShe askin' for bread for her parents and shit\nI told her, \"I don't got no cash\", and she said she could wait on a rack, on some Arabic shit\nI pull out a million and stare at the shit\nMy dick just got hard 'cause a wire just hit\nMy schedule is out, come spin us, for real\nMan, fuck all that spinnin' the narrative shit\nI melt down the chains that I bought from yo' boss\nGive a fuck about all of that heritage shit\nSince V not around, the members done hung up the Louis, they not even wearing that shit\nDon't come to the boy 'bout repairing some shit\nDon't come to the boy about sparing some shit\nYou lucky that Vogue was suing, 'cause I would've been with the Wassas in Paris and shit\nSee Travis Scott LiveGet tickets as low as $22You might also like[Part II]\n\n[Segue]\n(I-I—)\n\n[Verse 2: Travis Scott]\nIs you fuckin' crazy? Is you fuckin' crazy? (Ah)\nAnd they scared of the seven (Seven)\nAfter one-three then we turn up eleven (Yeah)\nKeep this shit open like 7-Eleven (It's lit)\nMe at the house, I got seven in heaven\nThey think I'm satanic, I keep me a reverend\nLil' shawty a therapist, poppin' her shit\nShe inching my way and she started confessing\nI know what's at stake, I'm screamin', \"Free Jeffery\"\nConnect collect calls right off of the celly\nGave her the blues, not talkin' 'bout belly\nDon't keep it sincere, I go Makaveli\nI got the juice, now it's heavy (Juice)\nAlways on t-time, been ready (T, ah), yeah\nIs you fucking crazy? Is you f— (Yeah, stoned, let's go)\nWrappin' the cheese, wrap around me 'cause I've got property (Wrap, cheese, wrap)\nChocolate AP and chocolate the Vs (Vs), got the Willy Wonka factory (Vs)\nBurn a athlete like it's calories, find another flame hot as me, bitch\n\n[Part III]\n[Segue: Travis Scott]\n(Ooh)\n\n[Chorus: Drake & Travis Scott]\nYeah, is you fucking crazy? (Nah)\nIs you fucking crazy? (What?)\nIs you fucking crazy? (Nah, nah)\nIs you fucking crazy? Uh\nIs you fucking crazy? Uh\nIs you fuckin'—\nIs you fuckin'—\nIs you fucking crazy?\n\n[Verse 3: Travis Scott]\nHow many Texas boys done ran it up? A couple, maybe (Couple, maybe)\nSwanging in the pickup truck, baby, fuck Mercedes (Fuck Mercedes)\nI'll fuck a nigga bitch but she can't have the baby (Have the baby)\nI'll shoot your ass in Walmart like I'm DaBaby (In Walmart)\nThe boy going Lionel Messi, I go Tom Brady (Woo)\nUsed to wear the bust down back in my old days (Woo)\nNow I let the chains hang, you gotta tuck yours maybe (Tuck it, tuck it)\nNiggas talkin' Scarface, I'm that in real life (Ooh)\nIs you fucking crazy or what? Is you fucking crazy? (Fuckin' crazy)\nMan, the club ain't been the same since we lost Mercedes (Straight up)\nMan, the clique ain't been the same since they lost the greatest (Nah, nah, nah)\nWe outside with the army, so you need the—, uh-uh\nThem boys rollin' all brown like they whippin' gravy\nMake a circus outside like it's Barnum's Bailey (It's lit)\nBlickey hanging on my side, it's like it's really banging (Blickey, blickey, blickey)\nShe move her panties to the side, she want it raw when faded (Huh? Huh? Huh? Huh?)\n[Chorus: Travis Scott]\nIs you fucking crazy? Uh\nIs you fucking crazy? Uh\nIs you fucking crazy or what?\nIs you fucking crazy? Yeah\nIs you fucking crazy or what?\nIs you fuckin'—\nIs you fuckin'—\nIs you fucking crazy?11Embed"